petermm/AtomVM/src/platforms/esp32/components/avm_builtins/network_driver.c
    return data;
}

// Free ScanClientData when all references have been released.
static void scan_data_release(struct ScanClientData *data)
{
    // TODO: change to LOGD
    ESP_LOGI(TAG, "Releasing scan reference...");
    if (atomic_fetch_sub(&data->ref_count, 1) == 1) {
        ESP_LOGI(TAG, "All references released, freeing scan data");
        free(data);
    }
}

static void send_scan_error_reason(Context *ctx, term pid, term ref, term reason)
{
    size_t error_size = PORT_REPLY_SIZE + TUPLE_SIZE(2) + TUPLE_SIZE(2);
    port_ensure_available(ctx, error_size);

    term error = port_create_error_tuple(ctx, reason);
    term scan_results_atom = make_atom(ctx->global, ATOM_STR("\xc", "scan_results"));
    term ret = port_create_tuple2(ctx, scan_results_atom, error);
    port_send_reply(ctx, pid, ref, ret);
}

// heap must be allocated and free'd by the caller
static void send_scan_error_from_task_heap(GlobalContext *global, term pid, term reason, term ref, Heap *heap)
{
    term error = port_heap_create_error_tuple(heap, reason);
    term scan_results_atom = make_atom(global, ATOM_STR("\xc", "scan_results"));
    term ret = port_heap_create_tuple2(heap, scan_results_atom, error);
    term msg = port_heap_create_tuple2(heap, ref, ret);
    port_send_message_from_task(global, pid, msg);
}

static void send_scan_results(struct ScanClientData *data)
{
    Context *ctx = data->ctx;
    uint64_t ref_ticks = data->ref_ticks;
    term local_process_term = term_from_local_process_id(data->owner_process_id);
    term ref = term_invalid_term();
    struct ScanClientData *owned;
    uint16_t discovered = 0;

    esp_err_t err = esp_wifi_scan_get_ap_num(&discovered);
    if (UNLIKELY(err != ESP_OK)) {
        // the ap_list must be cleared on failures to prevent a memory leak
        esp_wifi_clear_ap_list();
        ESP_LOGE(TAG, "Failed to obtain scan results, reason: %s", esp_err_to_name(err));
        const char *error = esp_err_to_name(err);
        size_t error_len = strlen(error);

        owned = take_scan_data_if_owner(ctx, ref_ticks);
        if (owned != NULL) {
            err = esp_event_handler_unregister(WIFI_EVENT, WIFI_EVENT_SCAN_DONE, &scan_done_handler);
            if (err == ESP_OK) {
                scan_data_release(owned);
            } else {
                ESP_LOGE(TAG, "Failed to unregister event handler for reason %s, future scans may fail",
                    esp_err_to_name(err));
            }
        }

        BEGIN_WITH_STACK_HEAP(PORT_REPLY_SIZE + TUPLE_SIZE(2) + TUPLE_SIZE(2) + TERM_BINARY_HEAP_SIZE(error_len), heap);
        term reason = term_from_literal_binary((const uint8_t *) error, (uint16_t) error_len, &heap, ctx->global);
        ref = term_from_ref_ticks(ref_ticks, &heap);
        send_scan_error_from_task_heap(ctx->global, local_process_term, reason, ref, &heap);
        END_WITH_STACK_HEAP(heap, ctx->global);
        return;
    }

    uint16_t num_results = data->num_results;
    uint16_t return_results;
    if (discovered > num_results) {
        return_results = num_results;
    } else {
        return_results = discovered;
    }
    wifi_ap_record_t *ap_records = NULL;
    if (return_results > 0) {
        ap_records = calloc(return_results, sizeof(wifi_ap_record_t));
    }
    if ((return_results > 0) && IS_NULL_PTR(ap_records)) {
        esp_wifi_clear_ap_list();

        owned = take_scan_data_if_owner(ctx, ref_ticks);
        if (owned != NULL) {
            err = esp_event_handler_unregister(WIFI_EVENT, WIFI_EVENT_SCAN_DONE, &scan_done_handler);
            if (err == ESP_OK) {
                scan_data_release(owned);
            } else {
                ESP_LOGE(TAG, "Failed to unregister event handler for reason %s, future scans may fail",
                    esp_err_to_name(err));
            }
        }

        BEGIN_WITH_STACK_HEAP(PORT_REPLY_SIZE + TUPLE_SIZE(2) + TUPLE_SIZE(2), heap);
        ref = term_from_ref_ticks(ref_ticks, &heap);
        send_scan_error_from_task_heap(ctx->global, local_process_term, OUT_OF_MEMORY_ATOM, ref, &heap);
        END_WITH_STACK_HEAP(heap, ctx->global);
        return;
    }

    if (return_results > 0) {
        err = esp_wifi_scan_get_ap_records(&num_results, ap_records);
    } else {
        esp_wifi_clear_ap_list();
        err = ESP_OK;
    }
    if (UNLIKELY(err != ESP_OK)) {
        // the ap_list must be cleared on failures to prevent a memory leak
        esp_wifi_clear_ap_list();
        ESP_LOGE(TAG, "Failed to obtain scan results, reason: %s", esp_err_to_name(err));
        const char *error = esp_err_to_name(err);
        size_t error_len = strlen(error);

        free(ap_records);
        owned = take_scan_data_if_owner(ctx, ref_ticks);
        if (owned != NULL) {
            err = esp_event_handler_unregister(WIFI_EVENT, WIFI_EVENT_SCAN_DONE, &scan_done_handler);
            if (err == ESP_OK) {
                scan_data_release(owned);
            } else {
                ESP_LOGE(TAG, "Failed to unregister event handler for reason %s, future scans may fail",
                    esp_err_to_name(err));
            }
        }

        BEGIN_WITH_STACK_HEAP(PORT_REPLY_SIZE + TUPLE_SIZE(2) + TUPLE_SIZE(2) + TERM_BINARY_HEAP_SIZE(error_len), heap);
        term reason = term_from_literal_binary((const uint8_t *) error, (uint16_t) error_len, &heap, ctx->global);
        ref = term_from_ref_ticks(ref_ticks, &heap);
        send_scan_error_from_task_heap(ctx->global, local_process_term, reason, ref, &heap);
        END_WITH_STACK_HEAP(heap, ctx->global);
        return;
    }
    ESP_LOGD(TAG, "Scan found %i networks", discovered);

    // return data: {scan_results, {NumberResults, [#{ssid => SSID, rssi => DBM, authmode => Mode, bssid => Bssid, chanel => ChNumber}]}}
    size_t ap_data_size = TUPLE_SIZE(2) + term_map_size_in_terms(5) + TERM_BINARY_HEAP_SIZE(SSID_MAX_SIZE) + TERM_BINARY_HEAP_SIZE(BSSID_SIZE) + (BOXED_INT_SIZE * 2);
    size_t results_size = PORT_REPLY_SIZE + TUPLE_SIZE(2) + TUPLE_SIZE(2) + LIST_SIZE(return_results, ap_data_size);
    // TODO: Change back to LOGD!!!
    ESP_LOGI(TAG, "Requesting size '%i' on heap for scan results", results_size);
    // BEGIN_WITH_STACK_HEAP(results_size, heap);
    Heap heap;
    if (UNLIKELY(memory_init_heap(&heap, results_size) != MEMORY_GC_OK)) {
        free(ap_records);
        BEGIN_WITH_STACK_HEAP(PORT_REPLY_SIZE + TUPLE_SIZE(2) + TUPLE_SIZE(2), err_heap);
        ref = term_from_ref_ticks(ref_ticks, &err_heap);
        send_scan_error_from_task_heap(ctx->global, local_process_term,
            OUT_OF_MEMORY_ATOM, ref, &err_heap);
        END_WITH_STACK_HEAP(err_heap, ctx->global);
        return;
    }

    term networks_data_list = term_nil();
    if (return_results != 0) {
        networks_data_list = wifi_ap_records_to_list_maybe_gc(ctx->global, ap_records, return_results, &heap);
    }
    free(ap_records);
    term scan_results = port_heap_create_tuple2(&heap, term_from_int(discovered), networks_data_list);
    term scan_results_atom = make_atom(ctx->global, ATOM_STR("\xc", "scan_results"));
    term ret = port_heap_create_tuple2(&heap, scan_results_atom, scan_results);
    ref = term_from_ref_ticks(ref_ticks, &heap);
    term msg = port_heap_create_tuple2(&heap, ref, ret);

    // If unregistering the scan done handler fails an error tuple is sent to the gen_server after
    // the scan results. This currently will fall through to the default info handler and print a
    // message on the console. A better way of handling this failure may be needed in the future.
    owned = take_scan_data_if_owner(ctx, ref_ticks);
    if (owned != NULL) {
        err = esp_event_handler_unregister(WIFI_EVENT, WIFI_EVENT_SCAN_DONE, &scan_done_handler);
        if (err == ESP_OK) {
            scan_data_release(owned);
        }
    }

    port_send_message_from_task(ctx->global, local_process_term, msg);
    memory_destroy_heap(&heap, ctx->global);
    // END_WITH_STACK_HEAP(heap, ctx->global);

