petermm/AtomVM/src/platforms/esp32/components/avm_builtins/network_driver.c
    // Send this event unregister error after the good scan results. This will be caught by the
    // catch-all handler and print a message to the console, if this is discovered to happen in the
    // wild, a future callback or other mechanism for programmatic notification may be needed, for
    // blocking scans this may need to have an alternative return that includes the unregister error,
    // along with the good results (since future scans may fail).
    if (err != ESP_OK) {
        const char *error = esp_err_to_name(err);
        ESP_LOGE(TAG, "Failed to unregister event handler for reason %s, future scans may fail", error);
        size_t error_len = strlen(error);
        BEGIN_WITH_STACK_HEAP(PORT_REPLY_SIZE + TUPLE_SIZE(2) + TUPLE_SIZE(2) + TERM_BINARY_HEAP_SIZE(error_len), heap);
        term reason = term_from_literal_binary((const uint8_t *) error, (uint16_t) error_len, &heap, ctx->global);
        term error_reply = port_heap_create_tuple2(&heap, ERROR_ATOM, reason);
        ref = term_from_ref_ticks(ref_ticks, &heap);
        term err_msg = port_heap_create_tuple2(&heap, ref, error_reply);
        port_send_message_from_task(ctx->global, local_process_term, err_msg);
        END_WITH_STACK_HEAP(heap, ctx->global);
    }
}

//
// Event Handlers and Handler Tasks
//

static void event_handler(void *arg, esp_event_base_t event_base, int32_t event_id, void *event_data)
{
    // TODO: Change all of the logging in event_handler to debug level, or move it to the
    // called send_* functions. We should not do any io operations inside the callback handler,
    // but debug output seems a fair trade off.
    struct ClientData *data = (struct ClientData *) arg;
    if (event_base == WIFI_EVENT) {

        switch (event_id) {

            case WIFI_EVENT_STA_START: {
                // TODO: expose an erlang callback so applications can choose how to respond to this
                // event, i.e. start a periodic scan for known networks, or initiate a connection
                ESP_LOGI(TAG, "WIFI_EVENT_STA_START received.");
                if (!data->managed) {
                    esp_wifi_connect();
                }
                break;
            }

            case WIFI_EVENT_STA_CONNECTED: {
                ESP_LOGI(TAG, "WIFI_EVENT_STA_CONNECTED received.");
                send_sta_connected(data);
                break;
            }

            case WIFI_EVENT_STA_DISCONNECTED: {
                ESP_LOGI(TAG, "WIFI_EVENT_STA_DISCONNECTED received.");
                send_sta_disconnected(data);
                break;
            }

            case WIFI_EVENT_AP_STACONNECTED: {
                ESP_LOGI(TAG, "WIFI_EVENT_AP_STACONNECTED received.");
                wifi_event_ap_staconnected_t *event = (wifi_event_ap_staconnected_t *) event_base;
                send_ap_sta_connected(data, event->mac);
                break;
            }

            case WIFI_EVENT_AP_STADISCONNECTED: {
                ESP_LOGI(TAG, "WIFI_EVENT_AP_STADISCONNECTED received.");
                wifi_event_ap_stadisconnected_t *event = (wifi_event_ap_stadisconnected_t *) event_base;
                send_ap_sta_disconnected(data, event->mac);
                break;
            }

            case WIFI_EVENT_AP_START: {
                ESP_LOGI(TAG, "WIFI_EVENT_AP_START received.");
                send_ap_started(data);
                break;
            }

#if (ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 2, 0))
            case WIFI_EVENT_HOME_CHANNEL_CHANGE: {
                wifi_event_home_channel_change_t *chan_data = (wifi_event_home_channel_change_t *) event_data;
                ESP_LOGD(TAG, "WIFI_EVENT home channel changed from %u to %u.", chan_data->old_chan, chan_data->new_chan);
                break;
            }
#endif

            case WIFI_EVENT_STA_BEACON_TIMEOUT: {
                ESP_LOGI(TAG, "WIFI_EVENT_STA_BEACON_TIMEOUT received. Maybe poor signal, or network congestion?");
                send_sta_beacon_timeout(data);
                break;
            }

            case WIFI_EVENT_SCAN_DONE: {
                ESP_LOGD(TAG, "WiFI network scan complete.");
                // Assure this wont be optimized away (if logging is disabled or lower than debug), so that
                // the gen_server doesn't receive spurious "Unhandled wifi event: 1" messages. The real handler
                // (scan_done_handler) is registered and unregistered per request. We catch this here so that
                // we can subscribe to all wifi events in network_start, otherwise each event needs to be
                // subscribed and unsubscribed individually.
                asm("nop");
                break;
            }

            default:
                ESP_LOGI(TAG, "Unhandled wifi event: %" PRIi32 ".", event_id);
                break;
        }

    } else if (event_base == IP_EVENT) {

        switch (event_id) {

            case IP_EVENT_STA_GOT_IP: {
                ip_event_got_ip_t *event = (ip_event_got_ip_t *) event_data;
                ESP_LOGI(TAG, "IP_EVENT_STA_GOT_IP: %s", inet_ntoa(event->ip_info.ip));
                // we restart sntp here for faster time sync (especially evident on coldboots)
                // the sntp_restart is no-op if sntp isn't configured
                esp_sntp_restart();
                send_got_ip(data, (esp_netif_ip_info_t *) &event->ip_info.ip);
                break;
            }

            case IP_EVENT_AP_STAIPASSIGNED: {
                ip_event_ap_staipassigned_t *event = (ip_event_ap_staipassigned_t *) event_data;
                ESP_LOGI(TAG, "IP_EVENT_AP_STAIPASSIGNED: %s", inet_ntoa(event->ip));
                send_ap_sta_ip_assigned(data, (esp_ip4_addr_t *) &event->ip);
                break;
            }

            default:
                ESP_LOGI(TAG, "Unhandled ip event: %" PRIi32 ".", event_id);
                break;
        }
    } else if (event_base == sntp_event_base) {

        switch (event_id) {

