petermm/AtomVM/src/platforms/esp32/components/avm_builtins/network_driver.c
            case SNTP_EVENT_BASE_SYNC: {
                ESP_LOGI(TAG, "SNTP_EVENT_BASE_SYNC received.");
                send_sntp_sync(data, (struct timeval *) event_data);
                break;
            }

            default:
                ESP_LOGI(TAG, "Unhandled sntp event: %" PRIi32 ".", event_id);
                break;
        }

    } else {
        ESP_LOGI(TAG, "Unhandled network event: %" PRIi32 ".", event_id);
    }
}

static void scan_results_task(void *arg)
{
    struct ScanClientData *data = (struct ScanClientData *) arg;
    send_scan_results(data);
    scan_data_release(data);
    vTaskDelete(NULL);
}

static void scan_done_handler(void *arg, esp_event_base_t event_base, int32_t event_id, void *event_data)
{
    struct ScanClientData *data = (struct ScanClientData *) arg;
    if (IS_NULL_PTR(data)) {
        return;
    }

    if (event_base == WIFI_EVENT && event_id == WIFI_EVENT_SCAN_DONE) {
        ESP_LOGD(TAG, "Scan complete.");
        scan_data_acquire(data);
        // Offload to a separate task — the event loop stack is too small
        // for the full send_scan_results → mailbox_message_create_from_term chain.
        BaseType_t results_task = xTaskCreate(scan_results_task, "avm_scan_res",
            CONFIG_ESP_MAIN_TASK_STACK_SIZE * 2,
            data, tskIDLE_PRIORITY + 5, NULL);
        if (results_task != pdPASS) {
            ESP_LOGE(TAG, "Failed to create scan_results task, out of memory!");
            size_t err_size = PORT_REPLY_SIZE + TUPLE_SIZE(2) + TUPLE_SIZE(2);
            BEGIN_WITH_STACK_HEAP(err_size, err_heap);
            term ref = term_from_ref_ticks(data->ref_ticks, &err_heap);
            term local_pid = term_from_local_process_id(data->owner_process_id);
            send_scan_error_from_task_heap(data->ctx->global, local_pid, OUT_OF_MEMORY_ATOM, ref, &err_heap);
            END_WITH_STACK_HEAP(err_heap, data->ctx->global);
            scan_data_release(data);
        }
    } else {
        ESP_LOGI(TAG, "Unhandled event in scan_done_handler: base=%s id=%" PRIi32, event_base, event_id);
    }
}

// static void scan_done_handler(void *arg, esp_event_base_t event_base, int32_t event_id, void *event_data)
// {
//     struct ScanClientData *data = (struct ScanClientData *) arg;
//     if (IS_NULL_PTR(data)) {
//         return;
//     }
//     scan_data_acquire(data);

//     if (event_base == WIFI_EVENT) {

//         switch (event_id) {

//             case WIFI_EVENT_SCAN_DONE: {
//                 ESP_LOGD(TAG, "Scan complete.");
//                 send_scan_results(data);
//                 break;
//             }

//             default:
//                 ESP_LOGI(TAG, "Unhandled wifi event in scan_done_handler: %" PRIi32 ".", event_id);
//                 break;
//         }
//     } else {
//         ESP_LOGI(TAG, "Unhandled network event caught by scan_done_handler: %" PRIi32 ".", event_id);
//     }
//     scan_data_release(data);
// }

//
// message processing
//

static wifi_config_t *get_sta_wifi_config(term sta_config, GlobalContext *global)
{
    if (term_is_invalid_term(sta_config)) {
        TRACE("No STA config\n");
        return NULL;
    }
    term ssid_term = interop_kv_get_value(sta_config, ssid_atom, global);
    term pass_term = interop_kv_get_value(sta_config, psk_atom, global);
    term managed_term = interop_kv_get_value_default(sta_config, managed_atom, FALSE_ATOM, global);

    bool roaming = false;
    if ((!term_is_invalid_term(managed_term)) && (managed_term != FALSE_ATOM)) {
        roaming = true;
    }

    //
    // Check parameters
    //
    if (term_is_invalid_term(ssid_term)) {
        if (roaming != true) {
            ESP_LOGE(TAG, "get_sta_wifi_config: Missing SSID");
        }
        return NULL;
    }
    int ok = 0;
    char *ssid = interop_term_to_string(ssid_term, &ok);
    if (!ok || IS_NULL_PTR(ssid)) {
        ESP_LOGE(TAG, "get_sta_wifi_config: Invalid SSID");
        return NULL;
    }

    char *psk = NULL;
    if (term_is_invalid_term(pass_term)) {
        ESP_LOGW(TAG, "Warning: Attempting to connect to open network");
    } else {
        psk = interop_term_to_string(pass_term, &ok);
        if (!ok) {
            free(ssid);
            ESP_LOGE(TAG, "get_sta_wifi_config: Invalid PSK");
            return NULL;
        }
    }

    //
    // Allocate wifi_config and check variable sizes
    //
    wifi_config_t *wifi_config = malloc(sizeof(wifi_config_t));
    if (IS_NULL_PTR(wifi_config)) {
        ESP_LOGE(TAG, "Failed to allocate wifi_config_t for sta");
        return NULL;
    }
    if (UNLIKELY(strlen(ssid) > sizeof(wifi_config->sta.ssid))) {
        ESP_LOGE(TAG, "ssid cannot be more than %d characters", sizeof(wifi_config->sta.ssid));
        free(ssid);
        free(psk);
        return NULL;
    }
    if (UNLIKELY(strlen(psk) > sizeof(wifi_config->sta.password))) {
        ESP_LOGE(TAG, "psk cannot be more than %d characters", sizeof(wifi_config->sta.password));
        free(ssid);
        free(psk);
        return NULL;
    }

    //
    // Initialize the wifi_config structure
    //
    memset(wifi_config, 0, sizeof(wifi_config_t));
    strcpy((char *) wifi_config->sta.ssid, ssid);
    if (!IS_NULL_PTR(psk)) {
        strcpy((char *) wifi_config->sta.password, psk);
        free(psk);
    }
    free(ssid);

    //
    // done
    //
    ESP_LOGI(TAG, "STA ssid: %s", wifi_config->sta.ssid);
    return wifi_config;
}

static char *get_default_device_name(esp_mac_type_t interface)
{
    uint8_t mac[6];
    esp_read_mac(mac, interface);

    size_t buf_size = strlen("atomvm-") + 12 + 1;
    char *buf = malloc(buf_size);
    if (IS_NULL_PTR(buf)) {
        ESP_LOGE(TAG, "Failed to allocate device name buf");
        return NULL;
    }
    snprintf(buf, buf_size,
        "atomvm-%02x%02x%02x%02x%02x%02x", mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
    return buf;
}

static wifi_config_t *get_ap_wifi_config(term ap_config, GlobalContext *global)
{
    if (term_is_invalid_term(ap_config)) {
        TRACE("No AP config\n");
        return NULL;
    }
    term ssid_term = interop_kv_get_value(ap_config, ssid_atom, global);
    term pass_term = interop_kv_get_value(ap_config, psk_atom, global);
    term channel_term = interop_kv_get_value(ap_config, ap_channel_atom, global);

    //
    // Check parameters
    //
    char *ssid = NULL;
    if (term_is_invalid_term(ssid_term)) {
        ssid = get_default_device_name(ESP_MAC_WIFI_SOFTAP);
    } else {
        int ok = 0;
        ssid = interop_term_to_string(ssid_term, &ok);
        if (!ok || IS_NULL_PTR(ssid)) {
            ESP_LOGE(TAG, "get_ap_wifi_config: Invalid SSID");
            return NULL;
        }
    }
    char *psk = NULL;
    if (term_is_invalid_term(pass_term)) {
        ESP_LOGW(TAG, "Warning: Empty password.  AP will be open network!");
    } else {
        int ok = 0;
        psk = interop_term_to_string(pass_term, &ok);
        if (strlen(psk) < 8) {
            free(ssid);
            ESP_LOGE(TAG, "get_ap_wifi_config: AP PSK must be length 8 or more");
            return NULL;
        }
        if (!ok || IS_NULL_PTR(psk)) {
            free(ssid);
            ESP_LOGE(TAG, "get_ap_wifi_config: Invalid PSK");
            return NULL;
        }
    }
    uint8_t channel = 0;
    if (!term_is_invalid_term(channel_term)) {
        channel = term_to_uint8(channel_term);
    }

    //
    // Allocate wifi_config and check variable sizes
    //
    wifi_config_t *wifi_config = malloc(sizeof(wifi_config_t));
    if (IS_NULL_PTR(wifi_config)) {
        ESP_LOGE(TAG, "Failed to allocate wifi_config_t for ap");
        return NULL;
    }
    if (UNLIKELY(strlen(ssid) > sizeof(wifi_config->ap.ssid))) {
        ESP_LOGE(TAG, "ssid cannot be more than %d characters", sizeof(wifi_config->ap.ssid));
        free(ssid);
        free(psk);
        return NULL;
    }
    if (!IS_NULL_PTR(psk) && UNLIKELY(strlen(psk) > sizeof(wifi_config->ap.password))) {
        ESP_LOGE(TAG, "psk cannot be more than %d characters", sizeof(wifi_config->ap.password));
        free(ssid);
        free(psk);
        return NULL;
    }

    //
    // Initialize the wifi_config structure
    //
    memset(wifi_config, 0, sizeof(wifi_config_t));
    strcpy((char *) wifi_config->ap.ssid, ssid);
    free(ssid);
    if (!IS_NULL_PTR(psk)) {
        strcpy((char *) wifi_config->ap.password, psk);
        free(psk);
    }
    if (channel != 0) {
        wifi_config->ap.channel = channel;
    }

