petermm/AtomVM/src/platforms/esp32/components/avm_builtins/network_driver.c
static void wifi_scan(Context *ctx, term pid, term ref, term config)
{
    wifi_mode_t mode;
    esp_err_t err = esp_wifi_get_mode(&mode);
    if ((err != ESP_OK) || ((mode != WIFI_MODE_STA) && (mode != WIFI_MODE_APSTA))) {
        ESP_LOGE(TAG, "WiFi must already be configured in STA or AP+STA mode to use network:wifi_scan/0,1");
        term reason = make_atom(ctx->global, ATOM_STR("\x10", "unsupported_mode"));
        send_scan_error_reason(ctx, pid, ref, reason);
        return;
    }

    term cfg_results = interop_kv_get_value_default(config, ATOM_STR("\x7", "results"), term_from_int(DEFAULT_SCAN_RESULT_MAX), ctx->global);
    if (UNLIKELY(!term_is_integer(cfg_results))) {
        ESP_LOGE(TAG, "results option must be an integer (i.e. {results, 6})");
        send_scan_error_reason(ctx, pid, ref, BADARG_ATOM);
        return;
    }

    avm_int_t cfg_results_val = term_to_int(cfg_results);
    uint16_t num_results = DEFAULT_SCAN_RESULT_MAX;
    if (UNLIKELY((cfg_results_val < 1) || (cfg_results_val > MAX_SCAN_RESULTS))) {
        ESP_LOGE(TAG, "results option must be between 1 and %u on this platform.", MAX_SCAN_RESULTS);
        send_scan_error_reason(ctx, pid, ref, BADARG_ATOM);
        return;
    } else {
        num_results = (uint16_t) cfg_results_val;
        ESP_LOGD(TAG, "Scan will return a maximum of %u results", num_results);
    }

    term term_passive = interop_kv_get_value_default(config, ATOM_STR("\x7", "passive"), term_invalid_term(), ctx->global);
    bool active_scan = true;
    if ((!term_is_invalid_term(term_passive)) && (term_passive != FALSE_ATOM)) {
        if (UNLIKELY(term_passive != TRUE_ATOM)) {
            ESP_LOGE(TAG, "'passive' config must be a bare atom or boolean tuple");
            send_scan_error_reason(ctx, pid, ref, BADARG_ATOM);
            return;
        }
        active_scan = false;
    }

    term cfg_dwell = interop_kv_get_value_default(config, ATOM_STR("\x5", "dwell"), term_invalid_term(), ctx->global);
    uint32_t dwell_ms = 0;
    if (cfg_dwell == term_invalid_term()) {
        if (active_scan == true) {
            dwell_ms = IDF_DEFAULT_ACTIVE_SCAN_TIME;
        } else {
            dwell_ms = IDF_DEFAULT_PASSIVE_SCAN_TIME;
        }
    } else {
        if (UNLIKELY(!term_is_integer(cfg_dwell))) {
            ESP_LOGE(TAG, "Channel dwell time milliseconds must be an integer (i.e. {dwell, 250})");
            send_scan_error_reason(ctx, pid, ref, BADARG_ATOM);
            return;
        }
        dwell_ms = (uint32_t) term_to_int(cfg_dwell);
        if (UNLIKELY((dwell_ms < 1lu) || (dwell_ms > 1500lu))) {
            ESP_LOGE(TAG, "Per channel dwell time milliseconds must be {dwell, 1..1500}");
            send_scan_error_reason(ctx, pid, ref, BADARG_ATOM);
            return;
        } else {
            ESP_LOGD(TAG, "Scan will spend %lu ms per channel", dwell_ms);
        }
    }

    term term_hidden = interop_kv_get_value_default(config, ATOM_STR("\xB", "show_hidden"), term_invalid_term(), ctx->global);
    bool show_hidden = false;
    if ((!term_is_invalid_term(term_hidden)) && (term_hidden != FALSE_ATOM)) {
        if (UNLIKELY(term_hidden != TRUE_ATOM)) {
            ESP_LOGE(TAG, "'show_hidden' config must be a bare atom or boolean tuple");
            send_scan_error_reason(ctx, pid, ref, BADARG_ATOM);
            return;
        }
        show_hidden = true;
    }

    wifi_scan_type_t scan_type = WIFI_SCAN_TYPE_ACTIVE;
    switch (active_scan) {
        case false:
            scan_type = WIFI_SCAN_TYPE_PASSIVE;
            break;
        case true:
            break;
    }

    wifi_scan_config_t *scan_config = (wifi_scan_config_t *) calloc(1, sizeof(wifi_scan_config_t));
    if (IS_NULL_PTR(scan_config)) {
        ESP_LOGE(TAG, "Unable to allocate memory for configuration");
        send_scan_error_reason(ctx, pid, ref, OUT_OF_MEMORY_ATOM);
        return;
    }

    if (scan_type == WIFI_SCAN_TYPE_ACTIVE) {
        scan_config->scan_time.active.max = dwell_ms;
        // For fast scans use the same min time as max (like ESP-IDF default), but for longer
        // per-channel dwell times set the min scan time to 1/2 of the maximum, but never less
        // than the 120ms min used in the default scan.
        if (dwell_ms > IDF_DEFAULT_ACTIVE_SCAN_TIME * 2) {
            scan_config->scan_time.active.min = (dwell_ms / 2);
        } else {
            scan_config->scan_time.active.min = dwell_ms;
        }
    } else {
        scan_config->scan_time.passive = dwell_ms;
        if (dwell_ms > 1000) {
            // Increase home channel dwell between scanning consecutive channel from 30 to 60ms to prevent beacon timeouts
            scan_config->home_chan_dwell_time = 60;
        }
    }

    scan_config->show_hidden = show_hidden;
    scan_config->scan_type = scan_type;

    struct ScanClientData *data = malloc(sizeof(struct ScanClientData));
    if (IS_NULL_PTR(data)) {
        ESP_LOGE(TAG, "Failed to allocate ClientData");
        send_scan_error_reason(ctx, pid, ref, OUT_OF_MEMORY_ATOM);
        free(scan_config);
        return;
    }
    data->ctx = ctx;
    data->owner_process_id = term_to_local_process_id(pid);
    data->ref_ticks = term_to_ref_ticks(ref);
    data->num_results = num_results;
    data->ref_count = 1;

    // Unregister any pending handlers, any currently running scans will be canceled if a new scan
    // is started. We don't need to check for an error here as an error would simply indicate that
    // no handlers were still registered.
    struct ScanClientData *old = claim_scan_data(ctx);
    if (old != NULL) {
        esp_event_handler_unregister(WIFI_EVENT, WIFI_EVENT_SCAN_DONE, &scan_done_handler);
        scan_data_release(old);
    }
    portENTER_CRITICAL_SAFE(&scan_ctx_mux);
    ctx->platform_data = data;
    portEXIT_CRITICAL_SAFE(&scan_ctx_mux);

    if ((err = esp_event_handler_register(WIFI_EVENT, WIFI_EVENT_SCAN_DONE, &scan_done_handler, data)) != ESP_OK) {
        ESP_LOGE(TAG, "Failed to register wifi event handler");
        send_scan_error_reason(ctx, pid, ref, term_from_int(err));
        ctx->platform_data = NULL;
        free(data);
        free(scan_config);
        return;
    }

    err = esp_wifi_scan_start(scan_config, false);
    free(scan_config);
    scan_config = NULL;
    if (UNLIKELY(err != ESP_OK)) {
        const char *err_str = esp_err_to_name(err);
        size_t error_len = strlen(err_str);
        size_t error_size = PORT_REPLY_SIZE + TUPLE_SIZE(2) + TUPLE_SIZE(2) + TERM_BINARY_HEAP_SIZE(error_len);
        port_ensure_available(ctx, error_size);
        term reason = term_from_literal_binary((const uint8_t *) err_str, (uint16_t) error_len, &ctx->heap, ctx->global);
        send_scan_error_reason(ctx, pid, ref, reason);
        err = esp_event_handler_unregister(WIFI_EVENT, WIFI_EVENT_SCAN_DONE, &scan_done_handler);
        if (UNLIKELY(err != ESP_OK)) {
            ESP_LOGE(TAG, "Failed to unregister event handler, future scans may fail");
        } else {
            ctx->platform_data = NULL;
            free(data);
        }
    }
    return;
}

static NativeHandlerResult consume_mailbox(Context *ctx)
{
    bool cmd_terminate = false;
    Message *message = mailbox_first(&ctx->mailbox);
    term msg = message->message;

    if (UNLIKELY(!term_is_tuple(msg) || term_get_tuple_arity(msg) != 3)) {
        ESP_LOGW(TAG, "Invalid message.  Ignoring.");
        return NativeContinue;
    }

